## pandas数据处理

# 1、删除重复元素
使用duplicated()函数检测重复的行，返回元素为布尔类型的Series对象，每个元素对应一行，如果该行不是第一次出现，则元素为True

- keep参数：指定保留哪一重复的行数据
- 创建具有重复元素行的DataFrame

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
#创建一个df
df = DataFrame(np.random.randint(0,100,size=(6,5)))
df

    0   1   2   3   4
0  95  43  65  33  11
1  82  16  28  32  34
2  22  58  42  84  49
3  98  79  64  40  53
4  85  59  20  52  56
5  76   8  84  64  94

In [4]:
#手动将df的某几行设置成相同的内容
df.iloc[1] = [4,4,4,4,4]
df.iloc[3] = [4,4,4,4,4]
df.iloc[4] = [4,4,4,4,4]
df

    0   1   2   3   4
0  95  43  65  33  11
1   4   4   4   4   4
2  22  58  42  84  49
3   4   4   4   4   4
4   4   4   4   4   4
5  76   8  84  64  94

In [5]:
df.duplicated() # 检测重复行

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

## 删除重复元素的行

- 方法1:

In [9]:
indexs = df[df.duplicated()].index
indexs

Int64Index([3, 4], dtype='int64')

In [10]:
df.drop(indexs)

    0   1   2   3   4
0  95  43  65  33  11
1   4   4   4   4   4
2  22  58  42  84  49
5  76   8  84  64  94

- 方法2

In [12]:
df.drop_duplicates()

    0   1   2   3   4
0  95  43  65  33  11
1   4   4   4   4   4
2  22  58  42  84  49
5  76   8  84  64  94

## 2. 映射
1 replace()函数：替换元素
使用replace()函数，对values进行映射操作

**Series替换操作**
单值替换
- 普通替换
- 字典替换(推荐）

多值替换
- 列表替换
- 字典替换（推荐）

参数
- to_replace:被替换的元素

## DataFrame替换操作
### 单值替换
- 普通替换： 替换所有符合要求的元素:to_replace=15,value='e'
- 按列指定单值替换： to_replace={列标签：替换值} value='value'

### 多值替换
- 列表替换: to_replace=[] value=[]
- 字典替换（推荐） to_replace={to_replace:value,to_replace:value}

In [14]:
df.replace(to_replace=4,value=5)  #把表中所有4该成5

    0   1   2   3   4
0  95  43  65  33  11
1   5   5   5   5   5
2  22  58  42  84  49
3   5   5   5   5   5
4   5   5   5   5   5
5  76   8  84  64  94

In [16]:
df.replace(to_replace={4:555})

     0    1    2    3    4
0   95   43   65   33   11
1  555  555  555  555  555
2   22   58   42   84   49
3  555  555  555  555  555
4  555  555  555  555  555
5   76    8   84   64   94

In [18]:
#指定列替换
df.replace(to_replace={0:4},value=1)  #第0列的4该成1

    0   1   2   3   4
0  95  43  65  33  11
1   1   4   4   4   4
2  22  58  42  84  49
3   1   4   4   4   4
4   1   4   4   4   4
5  76   8  84  64  94

In [21]:
#指定列替换
df.replace(to_replace={1:4},value=1)  #第0列的4该成1

    0   1   2   3   4
0  95  43  65  33  11
1   4   1   4   4   4
2  22  58  42  84  49
3   4   1   4   4   4
4   4   1   4   4   4
5  76   8  84  64  94

## 2) map()函数：新建一列 ， map函数并不是df的方法，而是series的方法

In [22]:
dic = {
    'name':['alex','jay','tom'],
    'salary':[5000,6000,9000],
    'dep':['sal','dev','sal']
}
df = DataFrame(data=dic)
df

   name  salary  dep
0  alex    5000  sal
1   jay    6000  dev
2   tom    9000  sal

In [29]:
df['salary'].map(lambda s:s+1)

0    5001
1    6001
2    9001
Name: salary, dtype: int64

In [ ]:
pd.read